[{"created":"20241112155527936","creator":"Syretia","text":"Rolling release Linux distros are a great way to get the latest software, but that does not come without potential problems. Users should have a good understanding of Linux before attempting to use one as their main distro.\n\n- Rolling release means no set release schedule; new software is released when it is ready.\n- Rolling release means always up to date.  Expect several relatively large updates per week.\n- Rolling release distros should be kept up to date.  Update checks should be ran at least once a week.\n- Rolling release means less time to test packages.  Be prepared for potential issues.\n\n## <div emoji=\"<:think:585665071938666508>\" style=\"display:none;\"/> Skills a User Should Have Before Using a Rolling Release Distro\n- Know how to troubleshoot problems.  Be familiar with the different logging systems for Linux and how to find useful output from them.\n- Know the general concept of how a package manager works on Linux.\n- Know how packages on Linux interact with each other.  Be aware of how dependencies work.\n- Know how to properly partition a Linux drive.\n- Know how to work in a terminal.  Terminals give more useful output when managing packages.  Be prepared to work without a GUI at all in case something breaks.\n- Know how to work with drivers.  Frequent kernel updates can sometimes mean driver issues.  Know how to troubleshoot these issues.\n\n## <div emoji=\"<:SeemsGood:478441196755091461>\" style=\"display:none;\"/> Recommended Rolling Release Distros\n- See <div emoji=\"`{prefix}info tumbleweed`\" style=\"display:none;\"/>[openSUSE Tumbleweed](#opensuse-tumbleweed)\n- See <div emoji=\"`{prefix}info arch`\" style=\"display:none;\"/>[Arch Linux](#arch-linux)","tags":"Linux","title":"rolling-releases","modified":"20241115142834427","modifier":"Syretia","type":"text/markdown","caption":"Rolling Releases","author_url":"https://discordlinux.github.io/wiki/#rolling-releases","author_icon":"https://cdn.discordapp.com/emojis/585665071938666508.png","embed_color":"#5865F2"}]