{
    "fields": [
        {
            "value": "• This is a common barrier for new Fedora users.  SELinux is a security measure that many think over-steps it's boundaries.\r\n• The easiest solution if SELinux is blocking an application you need is to put it into permissive mode: `sudo setenforce 0`",
            "name": "**SELinux**",
            "inline": false
        },
        {
            "value": "• [Fedy](https://github.com/rpmfusion-infra/fedy#introduction) essentially puts a list of some of the more common proprietary applications or harder to enable tweaks into a nice consise menu of one-click setups.",
            "name": "**Fedy**",
            "inline": false
        },
        {
            "value": "• [RPM Fusion](https://rpmfusion.org/Configuration)\r\n- Where you'll likely find most of the applications and tools you need that aren't in the official repos.\r\n• [Negativo17](https://negativo17.org/repositories/)\r\n-  If you'd rather enable one repo per application instead of one huge one, this is the route you should go.\r\n• [Flathub](https://flathub.org/home)\r\n- Not technically a third party repo but Fedora does have Flatpak enabled by default, so if all of the proprietary applications are available, it's worth trying out.\r\n- Flatpaks are sandboxes and typically come with tight file permissions, so some functions may not work or may require you to manually override file perms.\r\n\r\n[Download Fedora](https://getfedora.org)",
            "name": "**Recommended Third-Party Repos**",
            "inline": false
        }
    ],
    "description": "• Basically a much more up-to-date CentOS or RHEL.\r\n- Relatively easy syntax\r\n- Slower at installing packages than most other package managers\r\n• GNOME Desktop Environment is the main \"spin\" and is the only recommended way to use Fedora.\r\n- Other than the Xfce spin, most Fedora spins are lackluster.\r\n• Ships with only open source and unencumbered software in the official repos, you'll need to enable third party repos for anything closed source or with restrictive licensing.\r\n• 6-month release cycle with a 12-month support window.\r\n- Desktop Environment and core applications typically only get updated with a new release.\r\n- Kernel and mesa versions do get pushed frequently.\r\n• Not recommended for people new to Linux due to the release cycle and default partition setup.\r\n**Package manager**: `dnf`",
    "color": 2703730,
    "author": {
        "url": "https://getfedora.org/",
        "proxy_icon_url": "https://images-ext-1.discordapp.net/external/sj-ZUYHUANwrTDrq22STPWTJvO1dTSpznT5ZZX8Moak/https/raw.githubusercontent.com/simoniz0r/discord-rss-bot/master/Fedora-logo.svg.png",
        "name": "Fedora",
        "icon_url": "https://raw.githubusercontent.com/simoniz0r/discord-rss-bot/master/Fedora-logo.svg.png"
    }
}
