[{"created":"20241111172823213","creator":"Syretia","text":"Ubuntu is a point release Linux distribution that has two release cycles.  The LTS releases (always EvenNumber.04) are released every two years with point releases in between.  The LTS versions are the stable releases of Ubuntu.  Non LTS releases (anything other than EvenNumber.04) are supported for 9 months and not recommended for normal use.  The non LTS releases are frequently used to test things that do not work out well in the long run.  Ubuntu uses the apt package manager which is relatively intuitive and works well under most situations.\n\n[Screenshots of Ubuntu](https://commons.wikimedia.org/wiki/Category:Ubuntu_24.04)\n\n## <div emoji=\"<:SeemsGood:478441196755091461>\" style=\"display:none;\"/> Advantages of Ubuntu\n- The most beginner friendly Linux distribution.\n- The most well known and supported Linux distribution.\n- Ubuntu LTS releases are extremely stable and rarely have major issues.\n- Installing drivers is easier than on Windows in most cases using `Additional Drivers` in `Software & Updates`.\n- Most applications and games that are created for Linux are tested and built for Ubuntu first.\n- Has a huge community with tons of information that is easy to find through your favorite search engine.\n- Has more software available in base repositories than most other distributions.\n- Can use PPAs (Personal Package Archives) for installing packages not in the default repos or updating packages to newer versions.\n- Has two rolling kernel branches on the LTS releases which can be used to keep the kernel more up to date than the standard kernel branch.\n\n## <div emoji=\"<:glare:504911469943717909>\" style=\"display:none;\"/> Disadvantages of Ubuntu\n- Ships with `snapd` and a snap for gnome-system-monitor installed by default (see <div emoji=\"`{prefix}info snaps`\" style=\"display:none;\"/>[Snaps](#snaps) for more info on snaps).\n- Snaps are listed in GNOME software with little saying that they are not normal packages provided by Canonical.\n- Stock Ubuntu ships with the GNOME Desktop Environment which may be too heavy on resources for some systems.\n- GNOME lacks many customization options that other Desktop Environments provide.\n\n## <div emoji=\"<:think:585665071938666508>\" style=\"display:none;\"/> Should You Use Ubuntu?\nIf you are looking for a Linux distribution that is easy to use, well supported, very stable, and has tons of software available, Ubuntu and its flavors are the best choice.  Most people will be happier with an [Ubuntu flavor](https://ubuntu.com/download/flavours) than stock Ubuntu as they are easier on system resources and much more customizable.\n\n[Download Ubuntu](https://releases.ubuntu.com/24.04/)\n\nSee <div emoji=\"`{prefix}info kubuntu`\" style=\"display:none;\"/>[Kubuntu](#kubuntu), <div emoji=\"`{prefix}info xubuntu`\" style=\"display:none;\"/>[Xubuntu](#xubuntu), <div emoji=\"`{prefix}info ubuntu mate`\" style=\"display:none;\"/>[Ubuntu MATE](#ubuntu-mate), <div emoji=\"`{prefix}info lubuntu`\" style=\"display:none;\"/>[Lubuntu](#lubuntu), and <div emoji=\"`{prefix}info ubuntu budgie`\" style=\"display:none;\"/>[Ubuntu Budgie](#ubuntu-budgie) for more information about Ubuntu flavors.","tags":"Distributions","title":"ubuntu","modified":"20241115142225126","modifier":"Syretia","type":"text/markdown","caption":"Ubuntu","author_url":"https://discordlinux.github.io/wiki/#ubuntu","author_icon":"https://assets.ubuntu.com/v1/29985a98-ubuntu-logo32.png","embed_color":"#E95420"}]